In [1]:
import numpy as np
import pandas as pd

In [2]:
#imported data set from kaggle
df=pd.read_csv("G:\\data set kaggle\\loan_data.csv")
df.head(10)

,Unnamed: 0,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Total_Income
0,0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y,$5849.0
1,1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N,$6091.0
2,2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y,$3000.0
3,3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y,$4941.0
4,4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y,$6000.0
5,5,LP001011,Male,Yes,2,Graduate,Yes,5417,4196.0,267.0,360.0,1.0,Urban,Y,$9613.0
6,6,LP001013,Male,Yes,0,Not Graduate,No,2333,1516.0,95.0,360.0,1.0,Urban,Y,$3849.0
7,7,LP001014,Male,Yes,3+,Graduate,No,3036,2504.0,158.0,360.0,0.0,Semiurban,N,$5540.0
8,8,LP001018,Male,Yes,2,Graduate,No,4006,1526.0,168.0,360.0,1.0,Urban,Y,$5532.0
9,9,LP001020,Male,Yes,1,Graduate,No,12841,10968.0,349.0,360.0,1.0,Semiurban,N,$23809.0

In [5]:
#droped column
#df.drop(['Unnamed: 0'],axis=1,inplace=True)
df.drop(['Loan_ID','Married','Education',],axis=1,inplace=True)

In [6]:
#checked types of features in dataframe 
df.dtypes

Gender                object
Dependents            object
Self_Employed         object
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area         object
Loan_Status           object
Total_Income          object
dtype: object

In [7]:
#iterate object value in v1
v1=lambda x:float(x[1:-1])

In [8]:
#apply intirated value or coverted value in total_income feature
df.Total_Income=df.Total_Income.apply(v1)

In [9]:
#checked type changed or not
df.Total_Income.dtypes

dtype('float64')

In [12]:
# checked coorelation between features
df.corr()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Total_Income
ApplicantIncome,1.000000,-0.121292,0.583289,-0.069086,-0.031342,0.947170
CoapplicantIncome,-0.121292,1.000000,0.205980,0.006561,-0.028496,0.203479
LoanAmount,0.583289,0.205980,1.000000,0.030737,-0.032947,0.641289
Loan_Amount_Term,-0.069086,0.006561,0.030737,1.000000,0.018218,-0.066061
Credit_History,-0.031342,-0.028496,-0.032947,0.018218,1.000000,-0.039973
Total_Income,0.947170,0.203479,0.641289,-0.066061,-0.039973,1.000000

In [16]:
#droped dependents having object type
df.drop(['Dependents'],axis=1,inplace=True)

In [17]:
#find index value and types 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             491 non-null    object
 1   Self_Employed      473 non-null    object
 2   ApplicantIncome    500 non-null    int64
 3   CoapplicantIncome  500 non-null    float64
 4   LoanAmount         482 non-null    float64
 5   Loan_Amount_Term   486 non-null    float64
 6   Credit_History     459 non-null    float64
 7   Property_Area      500 non-null    object
 8   Loan_Status        500 non-null    object
 9   Total_Income       500 non-null    float64
dtypes: float64(5), int64(1), object(4)
memory usage: 31.3+ KB

In [20]:
#droped feature
df.drop(['Property_Area'],axis=1,inplace=True)

In [21]:
#import library and class for label encoding
import seaborn as sns
from sklearn.preprocessing import LabelEncoder

In [23]:
#did LabelEncoding of categorical feature and fit it into data frame
le=LabelEncoder()
df.iloc[:,0]=le.fit_transform(df.iloc[:,0])
df.iloc[:,1]=le.fit_transform(df.iloc[:,1])
df.iloc[:,7]=le.fit_transform(df.iloc[:,7])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             500 non-null    int32
 1   Self_Employed      500 non-null    int32
 2   ApplicantIncome    500 non-null    int64
 3   CoapplicantIncome  500 non-null    float64
 4   LoanAmount         482 non-null    float64
 5   Loan_Amount_Term   486 non-null    float64
 6   Credit_History     459 non-null    float64
 7   Loan_Status        500 non-null    int32
 8   Total_Income       500 non-null    int32
dtypes: float64(4), int32(4), int64(1)
memory usage: 27.4 KB

In [25]:
df.head(2)

,Gender,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Loan_Status,Total_Income
0,1,0,5849,0.0,NaN,360.0,1.0,1,274
1,1,0,4583,1508.0,128.0,360.0,1.0,0,285

In [26]:
#checked null value of features
print(df.isna().sum())

Gender                0
Self_Employed         0
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           18
Loan_Amount_Term     14
Credit_History       41
Loan_Status           0
Total_Income          0
dtype: int64

In [27]:
#find out mean value of Credit history
col = df['Credit_History']
print(type(col))
print(df['Credit_History'].mean())
print(col.mean())

<class 'pandas.core.series.Series'>
0.8431372549019608
0.8431372549019608

In [30]:
#fill mean value at null place and put it into feature Credit history
df['Credit_History'].fillna(value = df['Credit_History'].mean())
df['Credit_History'] = df['Credit_History'].fillna(value = df['Credit_History'].mean())
print(df.isna().sum())

Gender                0
Self_Employed         0
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           18
Loan_Amount_Term     14
Credit_History        0
Loan_Status           0
Total_Income          0
dtype: int64

In [31]:
#droped column having null values
df.dropna(axis=1,inplace=True)
print(df.shape)

(500, 7)

In [32]:
print(df.isna().sum())

Gender               0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
Credit_History       0
Loan_Status          0
Total_Income         0
dtype: int64

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Gender             500 non-null    int32
 1   Self_Employed      500 non-null    int32
 2   ApplicantIncome    500 non-null    int64
 3   CoapplicantIncome  500 non-null    float64
 4   Credit_History     500 non-null    float64
 5   Loan_Status        500 non-null    int32
 6   Total_Income       500 non-null    int32
dtypes: float64(2), int32(4), int64(1)
memory usage: 19.6 KB

In [34]:
#put value in independent and dependent variable
x=df.iloc[:,[0,1,2,3,4,6]]
y=df.iloc[:,5]
print(x.shape)
print(y.shape)

(500, 6)
(500,)

In [35]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=0)

In [36]:
#Create object for logistic regression class
from sklearn.linear_model import LogisticRegression
lr=LogisticRegression()

In [37]:
#fit x_train and x_train value 
lr.fit(x_train,y_train)

LogisticRegression()

In [38]:
#call model with x_test 
y_pred=lr.predict(x_test)

In [39]:
print("predicted value")
print(y_pred)
print("actual value")
print(y_test)

predicted value
[1 0 1 1 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1 1 0 1 0 1 0 1 1 1 1 1 1 1 1 1
 1 0 1 1 1 1 1 1 1 1 0 1 1 1 1 1 1 1 1 1 1 1 1 0 1 0 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 0 1 1 1 1 0 0 1 1 0 0 1 1 1 0 1 1 1 1 1]
actual value
90     1
254    0
283    1
445    1
461    1
      ..
372    1
56     1
440    1
60     1
208    1
Name: Loan_Status, Length: 100, dtype: int32

In [40]:
#checked accuracy of model
from sklearn.metrics import classification_report
print(classification_report(y_test,y_pred))

              precision    recall  f1-score   support

           0       0.93      0.54      0.68        26
           1       0.86      0.99      0.92        74

    accuracy                           0.87       100
   macro avg       0.90      0.76      0.80       100
weighted avg       0.88      0.87      0.86       100